package fate

import "github.com/godcong/chronos"

var NaYinList = map[string]string{
	"甲子": "海中金",
	"庚午": "花园土",
	"丙子": "涧下水",
	"壬午": "杨柳木",
	"戊子": "霹雳火",
	"甲午": "砂中金",
	"庚子": "壁上土",
	"丙午": "天河水",
	"壬子": "桑柘木",
	"戊午": "天上火",
	"乙丑": "海中金",
	"辛未": "花园土",
	"丁丑": "涧下水",
	"癸未": "杨柳木",
	"己丑": "霹雳火",
	"乙未": "砂中金",
	"辛丑": "壁上土",
	"丁未": "天河水",
	"癸丑": "桑柘木",
	"己未": "天上火",
	"丙寅": "炉中火",
	"壬申": "剑锋金",
	"戊寅": "城头土",
	"甲申": "井泉水",
	"庚寅": "松柏木",
	"丙申": "山下火",
	"壬寅": "金箔金",
	"戊申": "大驿土",
	"甲寅": "大溪水",
	"庚申": "石榴木",
	"丁卯": "炉中火",
	"癸酉": "剑锋金",
	"己卯": "城头土",
	"乙酉": "井泉水",
	"辛卯": "松柏木",
	"丁酉": "山下火",
	"癸卯": "金箔金",
	"己酉": "大驿土",
	"乙卯": "大溪水",
	"辛酉": "石榴木",
	"戊辰": "大林木",
	"甲戌": "山头火",
	"庚辰": "白蜡金",
	"丙戌": "屋上土",
	"壬辰": "长流水",
	"戊戌": "平地木",
	"甲辰": "覆灯火",
	"庚戌": "钗钏金",
	"丙辰": "砂中土",
	"壬戌": "大海水",
	"己巳": "大林木",
	"乙亥": "山头火",
	"辛巳": "白蜡金",
	"丁亥": "屋上土",
	"癸巳": "长流水",
	"己亥": "平地木",
	"乙巳": "覆灯火",
	"辛亥": "钗钏金",
	"丁巳": "砂中土",
	"癸亥": "大海水",
}
//NaYin 纳音
type NaYin struct {
	calendar *chronos.Calendar
}

//NewNaYin 创建纳音
func NewNaYin(calendar *chronos.Calendar) *NaYin {
	return &NaYin{
		calendar: calendar,
	}
}
