package provider

import (
	"log"
	"testing"
)

var str = "原标题：2020梁姓男孩名字大全\n\n2020梁姓男孩名字大全\n\n2020梁姓男孩名字，本文第一段给梁姓爸妈带来取自诗词的梁姓男孩名字;\n\n第二段给梁姓爸妈带来带字义分析的梁姓男孩名字;\n\n第三段给大家整理了一些梁姓高分好听名字供大家参考;\n\n2020梁姓男孩名字：取自诗词\n\n【梁德鑫】\n\n——取自宋高宗的诗句《永观厥成，德音秩秩。》\n\n德：德字念作dé,德字五行属火，用作人名意指具有仁爱之心、恩泽于民、德高望重。\n\n鑫：鑫字念作xīn,鑫字五行属金，用作人名意指财富、事业繁荣昌盛、多福多贵之义;\n\n【梁绍承】\n\n——取自董嗣杲的诗句《盛传覆第承华喻，别纪遗恩芾木阴。》\n\n绍：绍字念作shào,绍字五行属金，用作人名意指传承、发扬光大、开拓创新之义;\n\n承：承字念作chéng,承字五行属金，用作人名意指委以重任、坚持、能干之义;\n\n【梁沐夏】\n\n——取自韩愈的诗句《今来沐新恩，庶见返鸿朴。》\n\n\n沐：沐字念作mù,沐字五行属水，用作人名意指爽朗、吉祥如意之义;\n\n夏：夏字念作xià,夏字五行属火，用作人名意指开朗、热情、美丽之义;\n\n【梁以文】\n\n——取自韩维的诗句《双双河洲禽，文彩披丹质。》\n\n以：以字念作yǐ,以字五行属土，用作人名意指有远见、耐心、志向之义;\n\n文：文字念作wén,文字五行属水，用作人名意指文采、聪明、文静内敛。\n\n【梁富承】\n\n——取自释了元的诗句《山下走沧波，山巅富松栝。》\n\n富：富字念作fù,富字五行属水，用作人名意指富有、福气、丰润之义;\n\n承：承字念作chéng,承字五行属金，用作人名意指委以重任、坚持、能干之义;\n\n以上就是2020梁姓男孩名字带诗词出处的名字精选内容，下面给大家带来2020梁姓男孩名字带字义分析的名字推荐。\n\n2020梁姓男孩名字：带字义分析\n\n01、【梁永和】\n\n永：永字本义是指水常流不断，《诗经•周南•汉广》云“江之永矣，不可方思。”《疏》曰“永，长。”。后来也引申为长久、永久、长远。永字是人名常用字，因为它不仅能表现个人的健康长寿、家运永远，又能表现国家的昌盛、社会的安定。永字五行属水，\n\n和：平静;相安，谐调，平息争端。和字五行属水，用作人名意指关系和睦、智慧、温柔之义;\n\n02、【梁昱祺】\n\n昱：本义为新的一天。日光、光明、照耀。昱字五行属火，用作人名意指明亮、灿烂、照耀、前程似锦之义;\n\n祺：指吉祥，安祥。祺字五行属木，用作人名意指祥瑞、幸福之义;\n\n03、【梁予恒】\n\n予：指从我这里取，从我这里求;后指任意索取，给予，赞许，称誉。予字五行属土，用作人名意指恩惠、杰出、名誉之义;\n\n恒：本义指长久、持久;引申特指人的恒心。常常组成词语如永恒、恒久。恒字五行属水，用于人名意指持之以恒、坚定之义;\n\n04、【梁奕阳】\n\n奕：本义大，重迭;高大，美丽。奕字五行属木，用作人名意指风度、有神采、如花似玉之义;\n\n阳：阳是指太阳。引申为温暖、明亮、带正电的。中国古代哲学认为阳是宇宙中通贯所有物质的两大对立面之一，与“阴”相对。阳字五行属土，用作人名意指阳光、开朗、积极向上之义;\n\n05、【梁清尧】\n\n清：指纯洁、清明、清白、清雅高尚、清廉。清字五行属水，用作人名意指明白、清正廉明、纯洁之义;\n\n尧：指古代的一个圣明君王的名字。尧字五行属木，用作人名意指大权在握、正直、品德高尚之义;\n\n2020梁姓男孩名字\n\n\n【梁子荣】【梁成俊】【梁柯文】\n\n【梁清颜】【梁相豪】【梁逸川】\n\n【梁铭仁】【梁文嘉】【梁易涵】\n\n【梁柏焱】【梁永龙】【梁锦晔】\n\n【梁睿琪】【梁文希】【梁树奇】\n\n【梁志远】【梁一惟】【梁一芯】\n\n【梁乐成】【梁仲凯】【梁佳林】\n\n【梁俊旭】【梁则宇】【梁如玉】\n\n【梁子坤】【梁子轩】【梁宇彦】\n\n【梁小靖】【梁川皓】【梁文清】\n\n【梁晨宇】【梁杰恺】【梁泰皓】\n\n【梁瑞德】【梁金阳】【梁锦焱】\n\n【梁新哲】【梁崇熙】【梁锦睿】\n\n【梁一晗】【梁以祺】【梁俊哲】\n\n【梁俊辉】【梁嘉煊】【梁奕鑫】\n\n【梁子赫】【梁宜博】【梁思润】\n\n【梁意辰】【梁文俊】【梁文元】\n\n【梁晓叶】【梁晨曦】【梁梓煜】\n\n【梁治嘉】【梁煜森】【梁鑫浩】\n\n【梁俞仁】【梁丰君】【梁之润】\n\n【梁佳弘】【梁佳明】【梁俊程】\n\n【梁凯鑫】【梁博航】【梁向兴】\n\n【梁天乐】【梁子悦】【梁子贺】\n\n【梁安乐】【梁宏骏】【梁怀仁】\n\n【梁思泽】【梁恩西】【梁恩麒】\n\n【梁承宜】【梁敏从】【梁文华】\n\n【梁旭东】【梁明洁】【梁晓洋】\n\n【梁晨辉】【梁林冉】【梁梓城】\n\n【梁楠铭】【梁永文】【梁永豪】\n\n【梁沅森】【梁沅琛】【梁沐晨】\n\n【梁沛玉】【梁泽欢】【梁清铄】\n\n【梁炜彤】【梁珈晟】【梁皓丞】\n\n【梁睿琪】【梁耀坤】【梁耀淞】\n\n张桉宁起名专家温馨提示：如有需要，就可以找张桉宁起名专家，八字分析是传统起名的一项很重要的方法，其中重要的就是要看喜用神情况，当然要正确进行五行的缺补，此为吉祥名字要义第一步，宝宝取名之所以要考虑八字，是因为八字平衡才能趋利避害，逢凶化吉，在取名的时候弥补八字所缺，使宝宝八字平衡是非常重要的，从命理改运的角度讲，人的名字不仅仅是一个符号,它还包含着各种信息，就像咒语，好名越叫越吉，凶名越叫越凶，从而影响着一个人的学业、事业、感情和婚姻。返回搜狐，查看更多"

func TestTranslateFromSogou(t *testing.T) {
	result := TranslateFromSogou(str, "en")
	log.Println(result)

	result = TranslateFromSogou(result, "zh")
	log.Println(result)
}

func TestTranslateFromQQ(t *testing.T) {
	result := TranslateFromQQ(str, "en")
	log.Println(result)

	result = TranslateFromQQ(result, "zh")
	log.Println(result)
}
